# Дан список чисел. Определите, сколько в нем встречается различных чисел.

numbers = [130, 44, 22, 311, 523, 314, 5, 130, 311, 5]
unique_numbers = list(set(numbers))
print(len(unique_numbers))


# Дана последовательность из N целых чисел и число K. Необходимо сдвинуть всю последовательность (сдвиг - циклический)
# на K элементов вправо, K – положительное число.

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9]
n = len(numbers)
k = int(input('Введите колличество элементов для сдвига: '))

count = 0
while count < k:
    for i in range(n-1, 0, -1):
        memory = numbers[i]
        numbers[i] = numbers[i-1]
        numbers[i-1] = memory
    count += 1

print(numbers)


# Напишите программу для печати всех уникальных значений в словаре.
# list_1 = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"},
# {"VII": " S005 "}, {" V ":" S009 "}, {" VIII ":" S007 "}]

list_1 = [{"V": "S001"}, {"V": "S002"}, {"VI": "S001"}, {"VI": "S005"}, {"VII": "S005"}, {"V": "S009"}, {"VIII": "S007"}]
set_1 = set()
for i in list_1:
    print(i)
    for j in i:
        print(j)
        set_1.add(i[j])
print(set_1)

# Дан массив, состоящий из целых чисел. Напишите программу, которая подсчитает количество элементов массива,
# больших предыдущего (элемента с предыдущим номером). list_1 = [0, -1, 5, 2, 3]

list_1 = [0, -1, 5, 2, 3]

count = 0
for i in range(len(list_1) - 1):
    if list_1[i+1] > list_1[i]:
        count += 1

print(count)
